Repository: allapcallapc/SplitBalance
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Bills
fr: Factures

# splitsAndCategories
source: Categories
fr: Répartitions et Catégories

source: Summary
fr: Résumé

source: Settings
fr: Paramètres

source: Add Bill
fr: Ajouter une facture

source: Edit Bill
fr: Modifier la facture

source: Delete Bill
fr: Supprimer la facture

# areYouSureDeleteBill
source: Are you sure you want to delete this bill?
fr: Êtes-vous sûr de vouloir supprimer cette facture ?

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

source: Edit
fr: Modifier

source: Save
fr: Enregistrer

source: Add
fr: Ajouter

source: Retry
fr: Réessayer

source: Refresh
fr: Actualiser

# addBillTooltip
source: Add Bill
fr: Ajouter une facture

# refreshTooltip
source: Refresh
fr: Actualiser

# error
source: Error: {error}
fr: Erreur : {error}

source: No bills yet
fr: Aucune facture pour le moment

source: Add Your First Bill
fr: Ajouter votre première facture

source: Bill
fr: Facture

source: Amount
fr: Montant

source: Paid by
fr: Payé par

source: Category
fr: Catégorie

# selectWhoPaid
source: Please select who paid
fr: Veuillez sélectionner qui a payé

# selectCategory
source: Please select a category
fr: Veuillez sélectionner une catégorie

# enterValidAmount
source: Please enter a valid amount
fr: Veuillez entrer un montant valide

source: Details
fr: Détails

source: Select Storage Folder
fr: Sélectionner le dossier de stockage

# folderSelected
source: Folder selected! Checking folder data...
fr: Dossier sélectionné ! Vérification des données du dossier...

source: Sign Out?
fr: Se déconnecter ?

# signOutConfirmation
source: Do you want to sign out? You can sign back in later.
fr: Voulez-vous vous déconnecter ? Vous pourrez vous reconnecter plus tard.

# signOutButton
source: Sign Out
fr: Se déconnecter

source: Refresh Folders
fr: Actualiser les dossiers

source: Enter Person Names
fr: Entrer les noms des personnes

# enterPersonNamesPrompt
source: Please enter the names of the two people for this folder:
fr: Veuillez entrer les noms des deux personnes pour ce dossier :

# folderContainsDifferentNames
source: The folder contains data with different person names. Please enter the correct names:
fr: Le dossier contient des données avec des noms différents. Veuillez entrer les noms corrects :

source: Person 1 Name
fr: Nom de la personne 1

source: Person 2 Name
fr: Nom de la personne 2

# enterFirstName
source: Enter first person's name
fr: Entrer le nom de la première personne

# enterSecondName
source: Enter second person's name
fr: Entrer le nom de la deuxième personne

# enterBothPersonNames
source: Please enter both person names
fr: Veuillez entrer les deux noms de personnes

source: Change Folder
fr: Changer de dossier

source: Create Categories
fr: Créer des catégories

# createCategoriesPrompt
source: You need to create at least one category before you can add bills. Please go to the "Categories" tab in the bottom navigation to create categories.
fr: Vous devez créer au moins une catégorie avant de pouvoir ajouter des factures. Veuillez aller à l'onglet "Répartitions et Catégories" dans la navigation en bas pour créer des catégories.

source: Change Person Names
fr: Changer les noms des personnes

source: Go to Categories
fr: Aller aux catégories

source: Please sign in first
fr: Veuillez d'abord vous connecter

# errorLoadingFolders
source: Error loading folders: {error}
fr: Erreur lors du chargement des dossiers : {error}

source: Create New Folder
fr: Créer un nouveau dossier

# folderCreatedSuccessfully
source: Folder "{folderName}" created successfully
fr: Dossier "{folderName}" créé avec succès

# errorCreatingFolder
source: Error creating folder: {error}
fr: Erreur lors de la création du dossier : {error}

# configSaved
source: Configuration saved successfully
fr: Configuration enregistrée avec succès

# errorSavingConfig
source: Error saving config: {error}
fr: Erreur lors de l'enregistrement de la configuration : {error}

source: Sign in required
fr: Connexion requise

# signInRequiredMessage
source: Please sign in with your Google account to access all features of SplitBalance.
fr: Veuillez vous connecter avec votre compte Google pour accéder à toutes les fonctionnalités de SplitBalance.

source: Sign In with Google
fr: Se connecter avec Google

source: Folder Selection Required
fr: Sélection de dossier requise

# folderSelectionRequiredMessage
source: Please select a Google Drive folder to store your data.
fr: Veuillez sélectionner un dossier Google Drive pour stocker vos données.

source: Person Names Required
fr: Noms des personnes requis

# personNamesRequiredMessage
source: Please enter the names of both people using this folder.
fr: Veuillez entrer les noms des deux personnes utilisant ce dossier.

source: Navigate to Folder
fr: Naviguer vers le dossier

source: Loading...
fr: Chargement...

source: Loading path...
fr: Chargement du chemin...

source: Create
fr: Créer

source: My Drive
fr: Mon Drive

source: Unnamed
fr: Sans nom

# folderSelectedAndSaved
source: Folder "{folderName}" selected and saved. Checking folder data...
fr: Dossier "{folderName}" sélectionné et enregistré. Vérification des données du dossier...

# selectFolderFirst
source: Select a folder first
fr: Sélectionnez d'abord un dossier

source: Folder must be selected
fr: Un dossier doit être sélectionné

source: Theme
fr: Thème

source: Light
fr: Clair

source: Dark
fr: Sombre

source: Pink
fr: Rose

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

source: Clear All Configuration?
fr: Effacer toute la configuration ?

# clearAllConfigMessage
source: This will: • Sign out from Google • Clear folder selection • Clear person names • Clear all saved settings This action cannot be undone.
fr: Cela va : • Vous déconnecter de Google • Effacer la sélection du dossier • Effacer les noms des personnes • Effacer tous les paramètres enregistrés Cette action ne peut pas être annulée.

# clearAllConfigurationButton
source: Clear All Configuration
fr: Effacer toute la configuration

source: Clear All
fr: Tout effacer

# allConfigCleared
source: All configuration cleared
fr: Toute la configuration a été effacée

source: Calculate Balances
fr: Calculer les soldes

source: Add Payment Split
fr: Ajouter une répartition de paiement

source: Edit Payment Split
fr: Modifier la répartition de paiement

source: Start Date
fr: Date de début

source: End Date
fr: Date de fin

source: All Categories
fr: Toutes les catégories

# personPercentage
source: {personName} Percentage
fr: {personName} Pourcentage

# personPercentageDisplay
source: {personName} Percentage: {percentage}%
fr: {personName} Pourcentage : {percentage}%

source: Delete Payment Split
fr: Supprimer la répartition de paiement

# deletePaymentSplitMessage
source: Are you sure you want to delete this payment split?
fr: Êtes-vous sûr de vouloir supprimer cette répartition de paiement ?

# noPaymentSplits
source: No payment splits yet
fr: Aucune répartition de paiement pour le moment

# noCategories
source: No categories yet
fr: Aucune catégorie pour le moment

source: Add Category
fr: Ajouter une catégorie

source: Edit Category
fr: Modifier la catégorie

source: Delete Category
fr: Supprimer la catégorie

# deleteCategoryMessage
source: Are you sure you want to delete "{categoryName}"?
fr: Êtes-vous sûr de vouloir supprimer "{categoryName}" ?

# categoryInUse
source: Cannot delete category that is in use
fr: Impossible de supprimer une catégorie qui est utilisée

# categoryInUseSubtitle
source: This category is being used by bills or payment splits. Please remove or change them first.
fr: Cette catégorie est utilisée par des factures ou des répartitions de paiement. Veuillez d'abord les supprimer ou les modifier.

# enterCategoryName
source: Please enter a category name
fr: Veuillez entrer un nom de catégorie

source: Dismiss
fr: Ignorer

source: Payment Splits
fr: Répartitions de paiement

source: Categories
fr: Catégories

source: Recalculate
fr: Recalculer

source: No balance calculated
fr: Aucun solde calculé

source: All Balanced!
fr: Tout équilibré !

source: Net Balance
fr: Solde net

source: Paid
fr: Payé

source: Expected
fr: Attendu

source: Difference
fr: Différence

source: Category Breakdown
fr: Répartition par catégorie

source: Statistics
fr: Statistiques

source: Total Bills
fr: Total des factures

source: Total Amount
fr: Montant total

source: Save Bill
fr: Enregistrer la facture

# enterAmount
source: Please enter an amount
fr: Veuillez entrer un montant

source: Details (optional)
fr: Détails (optionnel)

# noCategoriesAvailable
source: No categories available. Please add categories in the Categories screen.
fr: Aucune catégorie disponible. Veuillez ajouter des catégories dans l'écran Répartitions et Catégories.

# errorSavingBill
source: Error saving bill: {error}
fr: Erreur lors de l'enregistrement de la facture : {error}

source: to
fr: à

# addCategoriesToOrganize
source: Add categories to organize your bills
fr: Ajoutez des catégories pour organiser vos factures

source: In use (cannot delete)
fr: En cours d'utilisation (ne peut pas être supprimé)

source: Google Drive Connection
fr: Connexion Google Drive

source: Google Drive Folder
fr: Dossier Google Drive

# selectGoogleDriveFolderPrompt
source: Please select a Google Drive folder where your data will be stored:
fr: Veuillez sélectionner un dossier Google Drive où vos données seront stockées :

# selectGoogleDriveFolderMessage
source: Please select a Google Drive folder where your data will be stored. You must select a folder before accessing other features.
fr: Veuillez sélectionner un dossier Google Drive où vos données seront stockées. Vous devez sélectionner un dossier avant d'accéder aux autres fonctionnalités.

source: Person Names
fr: Noms des personnes

# selectOrNavigateFolder
source: Select or navigate into a folder:
fr: Sélectionnez ou naviguez dans un dossier :

source: Save Configuration
fr: Enregistrer la configuration

source: Go back
fr: Retour

source: Navigate into folder
fr: Naviguer dans le dossier

source: Select this folder
fr: Sélectionner ce dossier

# allBalancedNoOneOwes
source: All balanced! No one owes anyone.
fr: Tout équilibré ! Personne ne doit rien à personne.

# personOwesPerson
source: {person1} owes {person2} {amount}
fr: {person1} doit {amount} à {person2}

source: Currently Used Folder:
fr: Dossier actuellement utilisé :

source: Folder Name
fr: Nom du dossier

source: Enter folder name
fr: Entrez le nom du dossier
